test/cassettes/shipments/refund.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"from_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"},"carbon_offset":"false"}'
    response:
        status:
            http_version: '2'
            code: '201'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: b0657e4262e3024bff246a9b003b14d4
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_5950e9ceb0f6429e89a81e7ce54e8afd
            content-type: 'application/json; charset=utf-8'
            content-length: '7049'
            etag: 'W/"3ee9c30cc7e379040018c9cbaf498b5c"'
            x-runtime: '1.057267'
            x-node: bigweb9nuq
            x-version-label: easypost-202207282048-993576a700-master
            x-backend: easypost
            x-proxied: ['intlb1nuq 403f17ff97', 'intlb2wdc 403f17ff97', 'extlb3wdc 403f17ff97']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-07-28T21:40:27Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361130507163","updated_at":"2022-07-28T21:40:28Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_e50eafe00ebd11ed8aeeac1f6bc72124","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_d7c5532e56554579a4af1dfb51d13506","object":"Parcel","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_3ad4bf2acc9d44b6a6c2ce3aa8dbd962","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:28Z","date_advance":0,"integrated_form":"none","label_date":"2022-07-28T21:40:27Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220728\/5e9749f05dab4d7d8dc0c69c42469104.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_c2da75816bc94ff383408eeabd91eb89","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e1dd4a4b49bc4fcbafc3fb83a575ce01","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_733b70f97fc34f9ba537ff9d5a181ba4","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_9d7817cc762a46148da8c91725eae831","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_9d7817cc762a46148da8c91725eae831","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_1f254ded0025411aab82e2edeac3e222","object":"Tracker","mode":"test","tracking_code":"9400100109361130507163","status":"unknown","status_detail":"unknown","created_at":"2022-07-28T21:40:28Z","updated_at":"2022-07-28T21:40:28Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzFmMjU0ZGVkMDAyNTQxMWFhYjgyZTJlZGVhYzNlMjIy"},"to_address":{"id":"adr_e50cef330ebd11ed8a6eac1f6b0a0d1e","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_e50eafe00ebd11ed8aeeac1f6bc72124","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_e50cef330ebd11ed8a6eac1f6b0a0d1e","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 818
            request_size: 307
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.324633
            namelookup_time: 0.001297
            connect_time: 0.02028
            pretransfer_time: 0.058133
            size_upload: 552.0
            size_download: 7049.0
            speed_download: 5321.0
            speed_upload: 416.0
            download_content_length: 7049.0
            upload_content_length: 552.0
            starttransfer_time: 0.058141
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.47.33.18
            certinfo: {  }
            primary_port: 443
            local_ip: 192.168.1.156
            local_port: 64513
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 58057
            connect_time_us: 20280
            namelookup_time_us: 1297
            pretransfer_time_us: 58133
            redirect_time_us: 0
            starttransfer_time_us: 58141
            total_time_us: 1324633
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_5950e9ceb0f6429e89a81e7ce54e8afd/refund'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
    response:
        status:
            http_version: '2'
            code: '200'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: b0657e3e62e3024cff246a9d003b152f
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8190'
            etag: 'W/"56397e07d78ce9175348af51b12c30dd"'
            x-runtime: '0.164686'
            x-node: bigweb4nuq
            x-version-label: easypost-202207282048-993576a700-master
            x-backend: easypost
            x-proxied: ['intlb1nuq 403f17ff97', 'intlb2wdc 403f17ff97', 'extlb3wdc 403f17ff97']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-07-28T21:40:27Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361130507163","updated_at":"2022-07-28T21:40:28Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_e50eafe00ebd11ed8aeeac1f6bc72124","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_d7c5532e56554579a4af1dfb51d13506","object":"Parcel","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_3ad4bf2acc9d44b6a6c2ce3aa8dbd962","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:28Z","date_advance":0,"integrated_form":"none","label_date":"2022-07-28T21:40:27Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220728\/5e9749f05dab4d7d8dc0c69c42469104.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_c2da75816bc94ff383408eeabd91eb89","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","billing_type":"easypost","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e1dd4a4b49bc4fcbafc3fb83a575ce01","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_733b70f97fc34f9ba537ff9d5a181ba4","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_9d7817cc762a46148da8c91725eae831","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":"submitted","scan_form":null,"selected_rate":{"id":"rate_9d7817cc762a46148da8c91725eae831","object":"Rate","created_at":"2022-07-28T21:40:27Z","updated_at":"2022-07-28T21:40:27Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_1f254ded0025411aab82e2edeac3e222","object":"Tracker","mode":"test","tracking_code":"9400100109361130507163","status":"pre_transit","status_detail":"status_update","created_at":"2022-07-28T21:40:28Z","updated_at":"2022-07-28T21:40:28Z","signed_by":null,"weight":null,"est_delivery_date":"2022-07-28T21:40:28Z","shipment_id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-06-28T21:40:28Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-06-29T10:17:28Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzFmMjU0ZGVkMDAyNTQxMWFhYjgyZTJlZGVhYzNlMjIy"},"to_address":{"id":"adr_e50cef330ebd11ed8a6eac1f6b0a0d1e","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_e50eafe00ebd11ed8aeeac1f6bc72124","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_e50cef330ebd11ed8a6eac1f6b0a0d1e","object":"Address","created_at":"2022-07-28T21:40:27+00:00","updated_at":"2022-07-28T21:40:27+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_5950e9ceb0f6429e89a81e7ce54e8afd","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_5950e9ceb0f6429e89a81e7ce54e8afd/refund'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 752
            request_size: 329
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.403807
            namelookup_time: 0.001303
            connect_time: 0.019485
            pretransfer_time: 0.055098
            size_upload: 0.0
            size_download: 8190.0
            speed_download: 20281.0
            speed_upload: 0.0
            download_content_length: 8190.0
            upload_content_length: 0.0
            starttransfer_time: 0.403778
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.47.33.18
            certinfo: {  }
            primary_port: 443
            local_ip: 192.168.1.156
            local_port: 64515
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 54990
            connect_time_us: 19485
            namelookup_time_us: 1303
            pretransfer_time_us: 55098
            redirect_time_us: 0
            starttransfer_time_us: 403778
            total_time_us: 403807
